{
    "projects": [
        { "title": "Hybrid EfficientNetV2-Transformer Model for Weed Detection", "description": "Advanced deep learning model combining EfficientNetV2 and Transformer architectures for precision weed detection with comprehensive model comparison and analysis.", "link": "https://github.com/ashvinmanojk289/Hybrid-EfficientNetV2-Transformer-Model-and-Other-Model-Comparison-for-Weed-Detection", "category": "cv", "tech": ["EfficientNetV2", "Transformer", "PyTorch", "Computer Vision"], "image": "assets/project1.webp", "caseStudy": "Problem: Traditional weed detection models often struggle with accuracy and efficiency, leading to imprecise agricultural interventions.\n\nSolution: I developed a hybrid architecture combining EfficientNetV2's superior feature extraction capabilities with Transformer's attention mechanisms for enhanced weed detection. The model includes comprehensive comparison with other state-of-the-art architectures to validate performance improvements.\n\nInnovation: The hybrid approach leverages EfficientNetV2's efficient scaling and Transformer's long-range dependencies to achieve superior accuracy while maintaining computational efficiency for real-world agricultural applications.\n\nTech Stack: Python, PyTorch, EfficientNetV2, Transformer Architecture, Computer Vision, Deep Learning." },
        { "title": "Simple Google PageRank Algorithm", "description": "Implementation of Google's PageRank algorithm for web page ranking, demonstrating fundamental concepts of link analysis and graph-based ranking systems.", "link": "https://github.com/ashvinmanojk289/Simple-Google-PageRank-Algorithm", "category": "nlp", "tech": ["Python", "Graph Theory", "PageRank", "Algorithm"], "image": "assets/project2.webp", "caseStudy": "Problem: Understanding and implementing the foundational algorithm that revolutionized web search and information ranking.\n\nSolution: I implemented Google's PageRank algorithm from scratch, demonstrating the mathematical principles behind web page ranking. The implementation showcases how link analysis and graph theory can be used to determine the importance and authority of web pages in a network.\n\nLearning Outcome: This project provided deep insights into graph-based algorithms, iterative mathematical computations, and the foundational concepts that power modern search engines and recommendation systems.\n\nTech Stack: Python, Graph Theory, Linear Algebra, Iterative Algorithms, Network Analysis." },
        { "title": "PDF Query Application", "description": "Developed a scalable, voice-enabled PDF query system using NLP and Streamlit, transforming static documents into conversational hubs.", "link": "https://github.com/ashvinmanojk289/PDF-Query-Application", "category": "nlp", "tech": ["NLP", "Streamlit", "GenAI"], "image": "assets/project3.webp", "caseStudy": "Problem: Extracting specific information from large PDF documents is time-consuming and inefficient.\n\nSolution: I developed a scalable, voice-enabled system using NLP models to transform static PDFs into conversational hubs. Users can ask questions in natural language (or voice) and receive instant, contextually accurate answers. This reduced information retrieval time by over 89%.\n\nTech Stack: Python, Streamlit, LangChain, Google Gemini Pro, FAISS." },
        { "title": "Quadruped Emoji Bot", "description": "A fun, interactive 4-legged robot that displays random emojis on an OLED screen, controlled wirelessly via a custom mobile app.", "link": "https://github.com/ashvinmanojk289/Quadrobot", "category": "robotics", "tech": ["Arduino", "Bluetooth", "Robotics"], "image": "assets/project4.webp", "caseStudy": "Problem: Creating an engaging, interactive hardware project that is both fun and demonstrates core robotics principles like locomotion and wireless control.\n\nSolution: I built a 4-legged robot controlled by an Arduino Nano. The robot can be commanded via a custom mobile app using an HC-05 Bluetooth module. To make it more interactive, it features an OLED screen that displays random, customizable emojis, adding personality to its movements.\n\nTech Stack: Arduino (C++), HC-05 Bluetooth, OLED Display, Servo Motors, Android (App Inventor)." },
        { "title": "Multilingual News Audio Translator", "description": "Revolutionary full-stack application using cutting-edge Wav2Vec 2.0 and mBART models for real-time audio translation across multiple languages.", "link": "https://github.com/ashvinmanojk289/FLASK_UI_FOR_MULTILINGUAL_NEWS_AUDIO_TRANSLATOR", "category": "nlp", "tech": ["Python", "Flask", "Hugging Face", "PyTorch"], "image": "assets/project5.webp", "caseStudy": "Problem: Live news broadcasts are often inaccessible to audiences who speak different languages.\n\nSolution: I developed a full-stack web application that translates spoken audio in near real-time. It uses a Wav2Vec 2.0 model for highly accurate speech recognition and a fine-tuned mBART model for fluent, context-aware translation between multiple languages.\n\nTech Stack: Python, Flask, Hugging Face (Transformers, Wav2Vec 2.0, mBART), PyTorch." },
        { "title": "Automatic Weed Detection and Spraying Robot", "description": "AI-powered autonomous robot that uses computer vision to differentiate between crops and weeds with 97% accuracy.", "link": "https://github.com/ashvinmanojk289/Weed-Detection-Robot", "category": "robotics", "tech": ["Python", "ROS", "PyTorch", "OpenCV"], "image": "assets/project6.webp", "caseStudy": "Problem: Traditional herbicide application in agriculture is often imprecise, leading to environmental damage and wasted resources.\n\nSolution: I built an AI-powered autonomous robot that uses computer vision to differentiate between crops and weeds with 97% accuracy. It navigates fields using ROS and applies herbicide directly to weeds, minimizing environmental impact. The core of the system is a custom-trained hybrid EfficientNetV2-Transformer model for robust detection.\n\nTech Stack: Python, ROS, PyTorch, Transformers, Computer Vision (OpenCV), Embedded Systems." }
    ],
    "testimonials": [
        { "quote": "Ashvin consistently delivers production-ready ML systems with clean engineering and reproducible experiments. Highly recommended for applied AI work.", "author": "Dr. Meera Krishnan, Research Supervisor" },
        { "quote": "Ashvin is a dependable ML engineer who balances model innovation with production constraints—excellent collaboration and technical delivery.", "author": "Rahul Menon, Product Lead" },
        { "quote": "His ability to quickly grasp complex systems and his contribution to improving our process efficiency was invaluable. He is a dedicated and resourceful engineer.", "author": "HR, Sunlux Technovations" }
    ]
}
